import fitz

doc = fitz.open("../static/template.pdf")

field_values = {
    "Text1": "ИНН",
    "Text2": "КПП",
    "Text4": "НОМЕР СПРАВКИ",
    "Text5.0": "КОР",
    "Text3": "ГОД",
    "Text6.0": "НАЗВАНИЕ ОРГ.",
    "Text6.1": "НАЗВАНИЕ ОРГ.1",
    "Text6.2": "НАЗВАНИЕ ОРГ.2",
    "Text6.3": "НАЗВАНИЕ ОРГ.3",
    "Text14.1": "0",  # форма обучения
    "Text7.0": "Фамилия плательщика",
    "Text7.1": "Имя плательщика",
    "Text7.2": "Отчество плательщика",
    "Text8": "ИНН плательщика",
    "Text9.0": "День даты рождения",
    "Text10.0": "Месяц рождения",
    "Text11.0": "Год рождения",
    "Text12": "Код вида документа",
    "Text13": "Серия и номер документа",
    "Text9.1.0.0": "Дата выдачи документа",
    "Text10.1.0.0": "Месяц выдачи документа",
    "Text11.1.0.0": "Год выдачи документа",
    "Text14.0": "Плательщик и обучаемый одно лицо? 0 - нет, 1 - да",
    "Text15.0": "Сумма расходов до точки",
    "Text16.0": "Сумма расходов после точки",
    "Text17.0": "Автор справки от орг. Фамилия",
    "Text17.1": "Автор справки от орг. Имя",
    "Text17.2": "Автор справки от орг. Отчество",
    "Text9.1.1": "Дата справки",
    "Text10.1.1": "Месяц выдачи справки",
    "Text11.1.1": "Год выдачи справки",
    "Text5.1": "Количество страниц справки",
    "Text18.0": "Фамилия ученика",
    "Text18.1": "Имя ученика",
    "Text18.2": "Отчество ученика",
    "Text20": "ИНН ученика",
    "Text21.0": "Дата рождения ученика",
    "Text22.0": "Месяц рождения ученика",
    "Text23.0": "Год рождения ученика",
    "Text25": "Код вида документа ученика",
    "Text260": "Серия и номер его документа",
    "Text21.1": "Дата выдачи документа",
    "Text22.1": "Месяц выдачи документа",
    "Text23.1": "Год выдачи документа",
    "Text30": "Дата справки",
}
print(doc.FormFonts)

for page in doc:
    for field in page.widgets():
        print(field)
        if field.field_name in field_values:
            field.text_font = "Cour"
            field.text_fontsize = 18
            field.field_value = field_values[field.field_name]
            field.update()

output_pdf = "test_pdf_filled.pdf"
doc.bake()
doc.save(output_pdf, encryption=fitz.PDF_ENCRYPT_NONE)
doc.close()
